from textual.app import App
from textual.widgets import Static
from textual.containers import Horizontal

from batcomputer.widgets.stats import Stats
from batcomputer.widgets.system_info import SystemInfo
from batcomputer.widgets.services import Services


class BatComputer(App):

    CSS_PATH = "batcomputer.tcss"

    def compose(self):
        yield Static(
"""[bold #FFD700]
██████╗  █████╗ ████████╗ ██████╗ ██████╗ ███╗   ███╗██████╗ ██╗   ██╗████████╗███████╗██████╗
██╔══██╗██╔══██╗╚══██╔══╝██╔════╝██╔═══██╗████╗ ████║██╔══██╗██║   ██║╚══██╔══╝██╔════╝██╔══██╗
██████╔╝███████║   ██║   ██║     ██║   ██║██╔████╔██║██████╔╝██║   ██║   ██║   █████╗  ██████╔╝
██╔══██╗██╔══██║   ██║   ██║     ██║   ██║██║╚██╔╝██║██╔═══╝ ██║   ██║   ██║   ██╔══╝  ██╔══██╗
██████╔╝██║  ██║   ██║   ╚██████╗╚██████╔╝██║ ╚═╝ ██║██║     ╚██████╔╝   ██║   ███████╗██║  ██║
╚═════╝ ╚═╝  ╚═╝   ╚═╝    ╚═════╝ ╚═════╝ ╚═╝     ╚═╝╚═╝      ╚═════╝    ╚═╝   ╚══════╝╚═╝  ╚═╝
[/bold #FFD700]"""
        )

        stats = Stats()
        stats.styles.width = 55

        info = SystemInfo()
        info.styles.width = 35

        with Horizontal():
            yield stats
            yield info

        yield Services()


if __name__ == "__main__":
    BatComputer().run()
